amarildolacerda/homeware/clients/esp8266_onoff/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ArduinoJson.h>
#include <EEPROM.h>
#include <ArduinoOTA.h>
#include <Updater.h>
#include <espnow.h>
#include <Espalexa.h>
#include <sys/time.h>
#include "config.h"
#include "pages.h"
#include "espnow_protocol.h"
#include "common_console.h"
#include "common_espnow.h"
#include "common_web.h"
#include "timer.h"

static const char *TAG = "esp8266-onoff";

static unsigned long s_last_state_update = 0;
static unsigned long s_last_telemetry_update = 0;
static unsigned long s_last_reconnect_attempt = 0;
static unsigned long s_last_espnow_send = 0;
static unsigned long s_last_espnow_pair = 0;
static unsigned long s_last_heartbeat = 0;
static unsigned long s_last_alexa_activity = 0;
static unsigned long s_send_deadline = 0;
static int s_send_retries_left = 0;
static unsigned long s_pair_wait_until = 0;

static bool s_gateway_connected = false;
static bool s_paired = false;
static uint8_t s_gateway_mac[6];
static uint16_t s_sequence = 0;
static uint16_t s_assigned_slot = 0;
static int s_pair_attempts = 0;
static bool s_ack_received = false;
static bool s_send_pending = false;
static bool s_espnow_ready = false;

static bool s_relay_state = false;
static int s_relay_pin = RELAY_PIN;
static int s_button_pin = BUTTON_PIN;
static int s_battery = 100;
static bool s_button_last = HIGH;
static unsigned long s_button_last_ms = 0;
static unsigned long s_start_time = 0;
static unsigned long s_last_send_ms = 0;
static uint32_t s_espnow_tx_count = 0;
static uint32_t s_espnow_rx_count = 0;
static uint32_t s_on_count = 0;

static char s_device_id[32];
static char s_device_name[32] = DEVICE_NAME;

static unsigned long s_wifi_config_start_time = 0;
static bool s_config_portal_active = false;
static bool s_use_repeater = false;
static bool s_led_enabled = true;
static int s_startup_mode = 0; // 0=OFF, 1=ON, 2=LAST
static uint8_t s_my_mac[6];
static unsigned long s_wifi_connect_start = 0;
static bool s_wifi_connected = false;

static ESP8266WebServer s_server(DASHBOARD_PORT);
static Espalexa s_alexa;
static EspalexaDevice *s_alexa_dev = nullptr;

static uint8_t s_broadcast_mac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
static unsigned long s_last_timer_check = 0;
static int s_timezone_offset = -3;
static unsigned long s_synced_epoch = 0;

static unsigned long get_synced_epoch(void) {
    time_t t = time(NULL);
    if (t > 100000) return (unsigned long)t;
    if (s_synced_epoch > 0)
        return s_synced_epoch + (millis() / 1000);
    return 0;
}


// D1-MINI é invtido
#define LED_ON  LOW   // GPIO2 acende com LOW
#define LED_OFF HIGH  // GPIO2 apaga com HIGH


#define EEPROM_GATEWAY_MAC_ADDR 0
#define EEPROM_GATEWAY_MAC_SIZE 6
#define EEPROM_NAME_ADDR 10
#define EEPROM_NAME_MAX 48
#define EEPROM_RELAY_STATE_ADDR (EEPROM_NAME_ADDR + EEPROM_NAME_MAX + 1)
#define EEPROM_RELAY_PIN_ADDR (EEPROM_RELAY_STATE_ADDR + 1)
#define EEPROM_BUTTON_PIN_ADDR (EEPROM_RELAY_PIN_ADDR + 1)
#define EEPROM_LED_ENABLED_ADDR (EEPROM_BUTTON_PIN_ADDR + 1)
#define EEPROM_STARTUP_MODE_ADDR (EEPROM_LED_ENABLED_ADDR + 1)
#define EEPROM_SSID_ADDR 64
#define EEPROM_SSID_MAX 32
#define EEPROM_PASS_ADDR (EEPROM_SSID_ADDR + EEPROM_SSID_MAX)
#define EEPROM_PASS_MAX 64
#define EEPROM_MAGIC 0xAA
#define EEPROM_PULSE_ENABLED_ADDR 224
#define EEPROM_PULSE_DURATION_ADDR 225

static bool s_pulse_enabled = false;
static uint16_t s_pulse_duration_min = PULSE_DEFAULT_DURATION_MIN;
static unsigned long s_pulse_on_time = 0;

static void set_relay(bool state);
static bool espnow_send_data(void);

static void on_timer_fire(uint8_t action)
{
    console.printf("[%s] Timer fired: action=%d\n", TAG, action);
    set_relay(action ? true : false);
    if (s_paired)
    {
        s_last_espnow_send = 0;
        espnow_send_data();
    }
}

static void save_relay_state(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_RELAY_STATE_ADDR, s_relay_state ? 1 : 0);
    EEPROM.commit();
    EEPROM.end();
}

static void load_relay_state(void)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t val = EEPROM.read(EEPROM_RELAY_STATE_ADDR);
    EEPROM.end();
    s_relay_state = (val == 1);
}

static void save_relay_pin(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_RELAY_PIN_ADDR, (uint8_t)s_relay_pin);
    EEPROM.commit();
    EEPROM.end();
}

static void load_relay_pin(void)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t val = EEPROM.read(EEPROM_RELAY_PIN_ADDR);
    EEPROM.end();
    if (val != 0xFF)
    {
        for (int i = 0; i < AVAILABLE_GPIOS_COUNT; i++)
        {
            if (AVAILABLE_GPIOS[i] == (int)val)
            {
                s_relay_pin = (int)val;
                return;
            }
        }
    }
}

static void save_button_pin(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_BUTTON_PIN_ADDR, (uint8_t)s_button_pin);
    EEPROM.commit();
    EEPROM.end();
}

static void load_button_pin(void)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t val = EEPROM.read(EEPROM_BUTTON_PIN_ADDR);
    EEPROM.end();
    if (val != 0xFF)
    {
        for (int i = 0; i < AVAILABLE_GPIOS_COUNT; i++)
        {
            if (AVAILABLE_GPIOS[i] == (int)val)
            {
                s_button_pin = (int)val;
                return;
            }
        }
    }
}

static void save_led_enabled(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_LED_ENABLED_ADDR, s_led_enabled ? 1 : 0);
    EEPROM.commit();
    EEPROM.end();
}

static void load_led_enabled(void)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t val = EEPROM.read(EEPROM_LED_ENABLED_ADDR);
    EEPROM.end();
    if (val == 0)
        s_led_enabled = false;
    else
        s_led_enabled = true;
}

static void save_startup_mode(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_STARTUP_MODE_ADDR, (uint8_t)s_startup_mode);
    EEPROM.commit();
    EEPROM.end();
}

static void load_startup_mode(void)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t val = EEPROM.read(EEPROM_STARTUP_MODE_ADDR);
    EEPROM.end();
    if (val <= 2)
        s_startup_mode = (int)val;
    else
        s_startup_mode = 0;
}

static void save_pulse_config(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_PULSE_ENABLED_ADDR, s_pulse_enabled ? 1 : 0);
    EEPROM.write(EEPROM_PULSE_DURATION_ADDR, s_pulse_duration_min & 0xFF);
    EEPROM.write(EEPROM_PULSE_DURATION_ADDR + 1, (s_pulse_duration_min >> 8) & 0xFF);
    EEPROM.commit();
    EEPROM.end();
}

