amarildolacerda/homeware/clients/esp8266_onoff/src/main.cpp
#ifdef LED_PIN
        console.printf("  Led:         %s\n", digitalRead(LED_PIN) == LED_ON ? "LIGADO" : "DESLIGADO");
#endif

        if (s_paired)
        {
            char mac_str[18];
            mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
            console.printf("  Gateway:     %s (slot %d) %s\n", mac_str, s_assigned_slot,
                           s_gateway_connected ? "conectado" : "desconectado");
        }
        else
        {
            console.printf("  Gateway:     nao pareado\n");
        }
        console.printf("  Dashboard:   http://%s:%d\n", WiFi.localIP().toString().c_str(), DASHBOARD_PORT);
        console.printf("  Alexa:       %s (ativo)\n", s_device_name);
        if (s_use_repeater)
        {
            char mac_str[18];
            mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
            console.printf("  Repeater:    %s\n", mac_str);
        }
        console.printf("  RSSI:        %d dBm\n", WiFi.RSSI());
        console.printf("  Uptime:      %lu s\n", up);
        console.printf("  Timers:      %d configurados\n", MAX_TIMERS);
        console.printf("  Epoch:       %lu\n", get_synced_epoch());
        console.printf("  Pulse:       %s (%d min)\n", s_pulse_enabled ? "ON" : "OFF", s_pulse_duration_min);
        if (s_pulse_enabled && s_relay_state)
            console.printf("  Pulso rest.: %lu s\n", (s_pulse_duration_min * 60000 - (millis() - s_pulse_on_time)) / 1000);
        console.printf("---------------\n\n");
        break;
    }
    }
}

static bool is_valid_gpio(int pin)
{
    for (int i = 0; i < AVAILABLE_GPIOS_COUNT; i++)
    {
        if (AVAILABLE_GPIOS[i] == pin)
            return true;
    }
    return false;
}

static void handle_api_settings(void)
{
    if (s_server.method() == HTTP_GET)
    {
        String json;
        JsonDocument doc;
        doc["device_name"] = s_device_name;
        doc["relay_pin"] = s_relay_pin;
        doc["button_pin"] = s_button_pin;
        doc["led_enabled"] = s_led_enabled;
        doc["startup_mode"] = s_startup_mode;
        JsonArray pins = doc["available_pins"].to<JsonArray>();
        for (int i = 0; i < AVAILABLE_GPIOS_COUNT; i++)
            pins.add(AVAILABLE_GPIOS[i]);
        serializeJson(doc, json);
        s_server.send(200, "application/json", json);
    }
    else if (s_server.method() == HTTP_POST)
    {
        String body = s_server.arg("plain");
        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, body);
        if (err)
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid JSON\"}");
            return;
        }
        bool changed = false;
        if (doc.containsKey("device_name"))
        {
            const char *new_name = doc["device_name"];
            if (espnow_is_valid_name(new_name) && strcmp(s_device_name, new_name) != 0)
            {
                strncpy(s_device_name, new_name, sizeof(s_device_name) - 1);
                s_device_name[sizeof(s_device_name) - 1] = '\0';
                espnow_save_device_name(s_device_name);
                if (s_alexa_dev)
                    s_alexa_dev->setName(s_device_name);
                console.printf("[%s] Device name changed to: %s\n", TAG, s_device_name);
                changed = true;
            }
        }
        if (doc.containsKey("relay_pin"))
        {
            int new_pin = doc["relay_pin"];
            if (!is_valid_gpio(new_pin))
            {
                s_server.send(400, "application/json", "{\"error\":\"invalid relay_pin\"}");
                return;
            }
            if (new_pin != s_relay_pin)
            {
                pinMode(s_relay_pin, INPUT);
                s_relay_pin = new_pin;
                pinMode(s_relay_pin, OUTPUT);
                digitalWrite(s_relay_pin, s_relay_state ? RELAY_ON : !RELAY_ON);
                save_relay_pin();
                console.printf("[%s] Relay pin changed to GPIO%d\n", TAG, s_relay_pin);
                changed = true;
            }
        }
        if (doc.containsKey("button_pin"))
        {
            int new_pin = doc["button_pin"];
            if (!is_valid_gpio(new_pin))
            {
                s_server.send(400, "application/json", "{\"error\":\"invalid button_pin\"}");
                return;
            }
            if (new_pin != s_button_pin)
            {
                pinMode(s_button_pin, INPUT);
                s_button_pin = new_pin;
                pinMode(s_button_pin, INPUT_PULLUP);
                s_button_last = digitalRead(s_button_pin);
                save_button_pin();
                console.printf("[%s] Button pin changed to GPIO%d\n", TAG, s_button_pin);
                changed = true;
            }
        }
        if (doc.containsKey("led_enabled"))
        {
            bool new_led = doc["led_enabled"];
            if (new_led != s_led_enabled)
            {
                s_led_enabled = new_led;
                save_led_enabled();
                console.printf("[%s] LED %s\n", TAG, s_led_enabled ? "enabled" : "disabled");
                changed = true;
            }
        }
        if (doc.containsKey("startup_mode"))
        {
            int new_mode = doc["startup_mode"];
            if (new_mode >= 0 && new_mode <= 2 && new_mode != s_startup_mode)
            {
                s_startup_mode = new_mode;
                save_startup_mode();
                console.printf("[%s] Startup mode set to %d\n", TAG, s_startup_mode);
                changed = true;
            }
        }
        if (!changed)
        {
            s_server.send(200, "application/json", "{\"status\":\"no changes\"}");
            return;
        }
        String json;
        JsonDocument resp;
        resp["device_name"] = s_device_name;
        resp["relay_pin"] = s_relay_pin;
        resp["button_pin"] = s_button_pin;
        resp["led_enabled"] = s_led_enabled;
        resp["startup_mode"] = s_startup_mode;
        resp["status"] = "ok";
        serializeJson(resp, json);
        s_server.send(200, "application/json", json);
    }
}

static void handle_api_timers(void)
{
    if (s_server.method() == HTTP_GET)
    {
        String json;
        JsonDocument doc;
        timer_to_json(doc);
        serializeJson(doc, json);
        s_server.send(200, "application/json", json);
    }
    else if (s_server.method() == HTTP_POST)
    {
        String body = s_server.arg("plain");
        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, body);
        if (err)
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid JSON\"}");
            return;
        }
        int timer_index = doc["index"] | -1;
        bool ok;
        if (timer_index >= 0) {
            timer_config_t cfg;
            cfg.hour = doc["hour"] | 0;
            cfg.minute = doc["minute"] | 0;
            cfg.action = doc["action"] | 0;
            cfg.days_mask = doc["days_mask"] | 0;
            cfg.enabled = doc["enabled"] | false;
            ok = timer_set(timer_index, &cfg);
        } else if (doc.containsKey("timers")) {
            ok = timer_from_json(doc);
        } else {
            // single timer without index — find first empty slot or append
            timer_config_t cfg;
            cfg.hour = doc["hour"] | 0;
            cfg.minute = doc["minute"] | 0;
            cfg.action = doc["action"] | 0;
            cfg.days_mask = doc["days_mask"] | 0;
            cfg.enabled = doc["enabled"] | false;
            for (timer_index = 0; timer_index < MAX_TIMERS; timer_index++) {
                timer_config_t tmp;
                timer_get(timer_index, &tmp);
                if (!tmp.enabled) { ok = timer_set(timer_index, &cfg); break; }
            }
            if (timer_index >= MAX_TIMERS) ok = false;
        }
        if (ok)
        {
            timer_save();
            String json;
            JsonDocument resp;
            resp["status"] = "ok";
            serializeJson(resp, json);
            s_server.send(200, "application/json", json);
        }
        else
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid timer config\"}");
        }
    }
}

static void handle_api_timer_next(void)
{
    unsigned long epoch = get_synced_epoch();
    if (!epoch)
    {
        s_server.send(503, "application/json", "{\"error\":\"no time sync\"}");
        return;
    }
    unsigned long next_epoch = 0;
    uint8_t next_action = 0;
    timer_get_next(epoch, s_timezone_offset, &next_epoch, &next_action);
    String json;
    JsonDocument doc;
    if (next_epoch > 0)
    {
        doc["has_next"] = true;
        doc["next_epoch"] = next_epoch;
        doc["next_action"] = next_action;
    }
    else
    {
        doc["has_next"] = false;
    }
    serializeJson(doc, json);
    s_server.send(200, "application/json", json);
}

static void handle_api_pulse(void)
{
    if (s_server.method() == HTTP_GET)
    {
        String json;
        JsonDocument doc;
        doc["enabled"] = s_pulse_enabled;
        doc["duration_minutes"] = s_pulse_duration_min;
        doc["remaining_s"] = (s_pulse_enabled && s_relay_state) ?
            ((s_pulse_duration_min * 60000 - (millis() - s_pulse_on_time)) / 1000) : 0;
        serializeJson(doc, json);
        s_server.send(200, "application/json", json);
    }
    else if (s_server.method() == HTTP_POST)
    {
        String body = s_server.arg("plain");
        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, body);
        if (err) { s_server.send(400, "application/json", "{\"error\":\"invalid JSON\"}"); return; }
        if (doc.containsKey("enabled"))
            s_pulse_enabled = doc["enabled"];
        if (doc.containsKey("duration_minutes"))
        {
            int val = doc["duration_minutes"];
            if (val < PULSE_MIN_MINUTES) val = PULSE_MIN_MINUTES;
            if (val > PULSE_MAX_MINUTES) val = PULSE_MAX_MINUTES;
            s_pulse_duration_min = (uint16_t)val;
        }
        if (s_pulse_enabled && s_relay_state)
            s_pulse_on_time = millis();
        save_pulse_config();
        String json;
        JsonDocument resp;
        resp["status"] = "ok";
        resp["enabled"] = s_pulse_enabled;
        resp["duration_minutes"] = s_pulse_duration_min;
        serializeJson(resp, json);
        s_server.send(200, "application/json", json);
    }
}

